Documents/ЗаявкаНаАрендуОборудования_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ЗаявкаНаАрендуОборудования_ат</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДействияПоЗаявкеНаАрендуОборудования_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Hostname</Name>
					<Comment>Короткое имя вашего сервера </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемПамяти</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемHDD</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыделениеCPU</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыделенныйСервер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Серверы_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РольСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКлиентов_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тикет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СтатусыЗаявокНаАренду_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>СтатусыЗаявокНаАренду_ат</Name>
			<Comment>!!!!!HOTFIX + переименовать</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСтатусовЗаявокНаАренду_ат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаАрендуОборудования_ат</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаАрендуПП_ат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/УчетРесурсовСерверов_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>УчетРесурсовСерверов_ат</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеРесурса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Серверы_ат</v8:Type>
						<v8:Type>cfg:CatalogRef.СХД_ат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВыделенныйСервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаименованиеРесурса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРесурсов_ат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры_ат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ДействияПоЗаявкеНаАрендуОборудования_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ДействияПоЗаявкеНаАрендуОборудования_ат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АрендаНовогоСервера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказОтСервера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСервера</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыДоговоров_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыДоговоров_ат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АрендаПрограммныхПродуктов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АрендаСерверов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интернет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обслуживание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаПрограммныхПродуктов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефония</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Хостинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыСтатусовЗаявокНаАренду_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыСтатусовЗаявокНаАренду_ат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаРассмотрении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОбработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполненаСИзменениями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаТехническомСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаФинансовомСогласовании</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыРесурсов_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыРесурсов_ат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>RAM</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HDD_ат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Частота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Core</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданНаСервере</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запущен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическийСервер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IPv4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>mask</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>gate</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>dns</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>dns2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AdmPass</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>numproc</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>autostart</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VEID</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазрешенаАренда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентИспользованияПроцессора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентИспользованияПамяти</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентИспользованияЖесткогоДиска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СборСтатистикиWMI</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СборСтатистикиVZ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СборСтатистикиZabbix</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаявкаНаАрендуОборудования_ат/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ИмяКонтейнераПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДействиеПриИзменении(Элемент)
	Если Объект.Проведен = Истина тогда 
	Иначе
		
		Если Не ПустаяСтрока(Объект.Действие) Тогда
			ДействиеПриИзмененииНаСервере();
			
			// это элементы вместо Действие = ОтказОтСервера
			// они определены выше, и достуаны на клиенте
			Если Элементы.ВыделенныйСервер.Видимость = Истина И
				Элементы.ВыделенныйСервер.ТолькоПросмотр = Ложь тогда
				сообщение = новый СообщениеПользователю;
				сообщение.Поле = "Объект.ВыделенныйСервер";
				сообщение.Текст = "Необходимо выбрать сервер, который вы хотите удалить!";
				сообщение.Сообщить();
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДействиеПриИзмененииНаСервере()
	Если Объект.Клиент.Пустая() тогда
		Сообщение = новый СообщениеПользователю;
		Сообщение.Поле = "Объект.Клиент";
		Сообщение.Текст = "Поле клиента должно быть заполнено!";
		Сообщение.Сообщить();
	Иначе
		 
		Если Объект.Действие = Перечисления.ДействияПоЗаявкеНаАрендуОборудования_ат.АрендаНовогоСервера тогда
			Элементы.РесурсыСервера.Видимость = Истина;
			Элементы.РесурсыСервера.ТолькоПросмотр = Ложь;	
			Элементы.ИмяКонтейнер.Видимость = истина;
			//ГСЧ = Новый ГенераторСлучайныхЧисел();
			//случ = СтрЗаменить(ГСЧ.СлучайноеЧисло(1000, 9999),Символы.НПП,"");
			
			 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ЗаявкаНаАрендуОборудования_ат.Номер) КАК Номер
		|ИЗ
		|	Документ.ЗаявкаНаАрендуОборудования_ат КАК ЗаявкаНаАрендуОборудования_ат";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если РезультатЗапроса.Пустой() тогда
		док = 1;           // это когда список пустой... 
	Иначе
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если  ВыборкаДетальныеЗаписи.номер = Null тогда
			Док = 1;
		Иначе 
			Док = Число(ВыборкаДетальныеЗаписи.номер);
		КонецЕсли;	
			// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	КонецЕсли;
	    префикс = "D";
		док = Прав(док+1,4);
		ГСЧ = Новый ГенераторСлучайныхЧисел();
		случ = ГСЧ.СлучайноеЧисло(100,999);
		Объект.Hostname = префикс+Прав(Объект.Клиент.код, 3)+"-"+док+"-"+случ;
		Элементы.ИмяКонтейнер.ТолькоПросмотр = Истина;
		Элементы.ИмяКонтейнер.Видимость = Истина;
		Элементы.ВыделенныйСервер.ТолькоПросмотр = Истина;
	
//			Элементы.ИмяКонтейнер.ТолькоПросмотр = Истина;
				ИначеЕсли Объект.Действие = Перечисления.ДействияПоЗаявкеНаАрендуОборудования_ат.ОтказОтСервера тогда
			Элементы.ИмяКонтейнер.Видимость = ложь;
			Элементы.РесурсыСервера.Видимость = Истина;
			Элементы.ВыделенныйСервер.Видимость = Истина;
			Элементы.ВыделенныйСервер.ТолькоПросмотр = Ложь;
			Элементы.ИмяКонтейнер.ТолькоПросмотр = Истина;

		ИначеЕсли Объект.Действие = Перечисления.ДействияПоЗаявкеНаАрендуОборудования_ат.ИзменениеСервера тогда
			Элементы.ИмяКонтейнер.Видимость = ложь;
			Элементы.ИмяКонтейнер.ТолькоПросмотр = Истина;

		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправляемыеФормы_Сервер_ат.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	ПравоНаАдминистрированиеСерверов = РольДоступна("ОрганизацияАдминистраторСерверов_ат") ИЛИ РольДоступна("ПолныеПрава");
	Пользователь = Пользователи.ТекущийПользователь();
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Элементы.ВыделенныйСервер.Видимость = Ложь;
		Элементы.ИмяКонтейнер.Видимость = Ложь;
		Если ПравоНаАдминистрированиеСерверов  Тогда
			
			Элементы.Клиент.ТолькоПросмотр 				= Ложь;
			Элементы.СтатусИсполнения.ТолькоПросмотр 	= Ложь;
			Элементы.ИмяКонтейнер.ТолькоПросмотр 		= Ложь;
			
		Иначе
			
			Планирование_Сервер_ат.ПервичноеЗаполнениеСотрудникКлиентПодразделение(Пользователь, Объект.Сотрудник, Объект.Клиент, Объект.Подразделение);
			
			Если НЕ Финансы_ат.ИмеетсяДоговорОпределённогоТипа(Объект.Клиент, Перечисления.ТипыДоговоров_ат.АрендаСерверов) Тогда
				
				Сообщить("Отсутствует договор на аренду оборудования");
				Отказ = Истина;
				Возврат;
				
			КонецЕсли;
			
			Элементы.Клиент.ТолькоПросмотр			= Истина;
			Элементы.Подразделение.ТолькоПросмотр	= Истина;
			Элементы.Сотрудник.ТолькоПросмотр		= Истина;
			
		КонецЕсли;
		
	Иначе
		
		Если НЕ ПравоНаАдминистрированиеСерверов тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СтатусыЗаявокНаАренду_атСрезПоследних.Статус
			|ИЗ
			|	РегистрСведений.СтатусыЗаявокНаАренду_ат.СрезПоследних КАК СтатусыЗаявокНаАренду_атСрезПоследних
			|ГДЕ
			|	СтатусыЗаявокНаАренду_атСрезПоследних.Заявка = &Заявка";
			
			Запрос.УстановитьПараметр("Заявка", Объект.Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Если ВыборкаДетальныеЗаписи.Статус = Перечисления.ТипыСтатусовЗаявокНаАренду_ат.НаРассмотрении Тогда
					
					ЭтаФорма.ТолькоПросмотр = Ложь;
					
				Иначе
					
					ЭтаФорма.ТолькоПросмотр = Истина;
					
					Элементы.ВыделенныйСервер.Видимость 		= Истина;
					Элементы.ИмяКонтейнер.ТолькоПросмотр 		= Истина;
					Элементы.Действие.ТолькоПросмотр 			= Истина;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если Объект.Действие.Пустая() тогда
			Элементы.РесурсыСервера.Видимость = ложь;
			Элементы.ИмяКонтейнер.Видимость = ложь;
		ИначеЕсли Объект.Действие = Перечисления.ДействияПоЗаявкеНаАрендуОборудования_ат.АрендаНовогоСервера тогда
			Элементы.ВыделенныйСервер.Видимость = ложь;
		ИначеЕсли Объект.Действие = Перечисления.ДействияПоЗаявкеНаАрендуОборудования_ат.ОтказОтСервера тогда
			Элементы.ИмяКонтейнер.Видимость = ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПравоНаАдминистрированиеСерверов Тогда
		
		Элементы.Клиент.КнопкаОчистки 			= Истина;
		Элементы.Подразделение.КнопкаОчистки 	= Истина;
		Элементы.Сотрудник.КнопкаОчистки 		= Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделенныйСерверНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ложь;
	Если Объект.Клиент.Пустая() тогда
		
		сообщение = новый СообщениеПользователю;
		сообщение.Поле = "Объект.Клиент";
		сообщение.Текст = "Поле Клиент должно быть заполнено";
		сообщение.Сообщить();
		
	Иначе
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РежимВыбора",Истина);
		ПараметрыФормы.Вставить("ЗакрытьПриВыборе", Истина);
		ПараметрыФормы.Вставить("Клиент", Объект.Клиент);
		ОткрытьФорму("Документ.ЗаявкаНаАрендуОборудования_ат.Форма.ФормаВыбораВыделенныхСерверов",ПараметрыФормы,Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделенныйСерверПриИзменении(Элемент)
	
	ВыделенныйСерверПриИзмененииНаСервере();
	ОбновитьИнтерфейс();
	
КонецПроцедуры

&НаСервере
Процедура ВыделенныйСерверПриИзмененииНаСервере()
	
	Если Объект.ВыделенныйСервер.Пустая() тогда
		
		сообщение = новый СообщениеПользователю;
		сообщение.Поле = "Объект.ВыделенныйСервер";
		сообщение.Текст = "Поле ВыделенныйСервер должно быть заполнено!";
		сообщение.Сообщить();
		
	Иначе
		
		ВыделенныйСервер = Объект.ВыделенныйСервер;
		Объект.Hostname = ВыделенныйСервер.Наименование;
		Элементы.ИмяКонтейнер.Видимость = Истина;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчетРесурсов_атОстатки.НаименованиеРесурса,
		|	УчетРесурсов_атОстатки.ЗначениеРесурсаОстаток
		|ИЗ
		|	РегистрНакопления.УчетРесурсовСерверов_ат.Остатки КАК УчетРесурсов_атОстатки
		|ГДЕ
		|	УчетРесурсов_атОстатки.ВыделенныйСервер = &ВыделенныйСервер";
		
		Запрос.УстановитьПараметр("ВыделенныйСервер", ВыделенныйСервер);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если ВыборкаДетальныеЗаписи.НаименованиеРесурса = Перечисления.ТипыРесурсов_ат.RAM тогда
					Объект.ОбъемПамяти = ВыборкаДетальныеЗаписи.ЗначениеРесурсаОстаток;
				ИначеЕсли ВыборкаДетальныеЗаписи.НаименованиеРесурса = Перечисления.ТипыРесурсов_ат.HDD_ат тогда 	
				    Объект.ОбъемHDD = ВыборкаДетальныеЗаписи.ЗначениеРесурсаОстаток;
				ИначеЕсли ВыборкаДетальныеЗаписи.НаименованиеРесурса = Перечисления.ТипыРесурсов_ат.Core тогда
					Объект.ВыделениеCPU = ВыборкаДетальныеЗаписи.ЗначениеРесурсаОстаток;					
				КонецЕсли;
			КонецЦикла;
			
		Иначе
			
			сообщение = новый СообщениеПользователю;
			//сообщение.Поле = "Объект.ВыделенныйСервер";
			сообщение.Текст = "Ошибка получения данных - ресурсов нет! Выделенный Сервер есть!";
			сообщение.Сообщить();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		Планирование_Сервер_ат.ПервичноеЗаполнениеСотрудникКлиентПодразделение(Объект.Сотрудник, Объект.Сотрудник, Объект.Клиент, Объект.Подразделение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	КлиентПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура КлиентПриИзмененииНаСервере()
	
	Объект.Подразделение = Неопределено;
	Объект.Сотрудник = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	ПодразделениеПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПодразделениеПриИзмененииНаСервере()
	
	Объект.Сотрудник = Неопределено;
	
КонецПроцедуры
